# git - это система управления версиями кода

# github - сайт, который дает хранилище для кода
# также есть gitlab, bitbucket

# репозиторий - папка с проектом с которой может работать git

# ssh-keygen - создание ключа

# git config --global user.name "your name"
# git config --global user.email "your email"
# указание своих данных

# git init - первратить папку в репозиторий, создает скрытую папку .git


# создаете репозитроий на github
# git remote add origin и ссылка на репозиторий ssh - добавить ссылку на репозиторий в переменную origin
# git add . / filename - (либо точка, либо имя файла) добавляет указанные файлы в индекс / начинает отслеживание файлов
# git commit -m "название версии" - создание версии кода / создать сохранение кода

# git push origin [или ссылка на репозиторий] имя_ветки - отправить версию кода на github
